Revit 2026 API

# MEPSectionFrictionFactor Property

---

The friction factor of the section.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double FrictionFactor { get; }
```
```vb
Public ReadOnly Property FrictionFactor As Double
	Get
```
```cpp
public:
property double FrictionFactor {
	double get ();
}
```
```fsharp
member FrictionFactor : float with get
```

#### Property Value

Double

Friction Factor is a number. The friction factor type is UT_Number.

#### Reference

MEPSection Class

Autodesk.Revit.DB.Mechanical Namespace